module.exports = {
  //个人介绍配置项
  introduce: "目前任职于鲁班软件股份有限公司研发中心项目二部（在职、地点南昌）。从事前端开发工作7年，热爱前端开发，拥有丰富的前端开发经验，掌握node.js技术，同时对后端技术有一定的了解。有强烈的团队合作意识，执行力、沟通能力强，拥有带领前端团队经验。曾经参与的人脸识别项目获得过深圳市龙岗公安分局表扬嘉奖，并且项目中的相关技术获得过国家专利（本人也是专利次发明人之一），同时该专利获得了第二十二届中国专利优秀奖。",
  //技能配置项
  technologies:[
    "精通HTML、CSS、JavaScript、Typescript等前端开发技术，熟悉W3C标准规范、ECMA标准",
    "精通ES6语法，熟练使用ES6语法进行前端开发",
    "精通React、Vue、JQuery框架 ",
    "精通antd design、layui等UI框架，能熟练应用到项目中，具有很强的文档阅读能力",
    "精通Fetch、AJAX、Axios等前后端数据请求技术",
    "熟练掌握网站优化，有效的对代码进行精简，提升客户端性能",
    "熟练使用前端CSS集成工具SASS、LESS，减少重复性操作，提高开发效率",
    "熟练使用Git版本管理工具及gulp、webpack前端自动化构建工具",
    "熟练使用VSCode,Sublime等主流开发工具进行开发工作",
    "熟练使用Linux常用命令，对nginx有一定了解",
    "熟练使用Linux常用命令，对nginx有一定了解"
  ],
  //技术工具配置项
  tools:[
    "熟练使用webpack、gulp前端自动化构建工具及Git版本管理工具",
    "熟练使用VSCode, Sublime等主流IDE进行开发工作",
    "熟练xshell、winscp等服务端工具使用经验"
  ],
  //工作经历配置项
  experiences: [
    {
      companyName: "鲁班软件股份有限公司",
      position: "资深前端开发工程师",
      dateRanges: "2021.08-至今",
      explain: "任职于研发中心项目二部，工作地点南昌，主要负责公司业务系统针对南昌客户的系统定制开发工作。具体工作内容有：1.负责管理南昌前端团队；2.根据客户需求，提供前端技术支持；3.分配前端开发任务并参与部分开发工作；4.编写相关开发文档、技术资料；5.调研前端新技术，学习分享新技术提升团队能力。"
    },
    {
      companyName: "深圳市华云中盛科技股份有限公司",
      position: "高级前端开发工程师 ",
      dateRanges: "2019.06-2021.06",
      explain: "部门业务主要是为深圳市税务局开发税务相关系统。本人在该公司的具体工作内容有：1.负责项目前端需求评审、制定前端开发任务；2.分配前端任务、协调前端人员参与项目开发；3.把控项目开发进度及时完成业务开发；4.编写相关开发文档、技术资料；5.推动产品前端组件化，业务模块化；6.调研前端新技术，学习分享新技术提升团队能力。"
    },
    {
      companyName: "深圳云天励飞技术有限公司",
      position: "前端开发工程师 ",
      dateRanges: "2016.09-2019.06",
      explain: "云天励飞技术有限公司是一家人工智能技术创新型企业，公司产品主要以智能安防领域为主。核心系统项目【XX人脸识别系统】，曾协助公安机关破获多起重要案件，本人的主要工作就是参与开发并维护该系统。在该公司任职期间，经历了系统从最初的jQuery框架到React框架的重构历程，实现前端页面组件化、业务模块化。任职期间工作成绩优异，参与项目获客户好评，系统相关技术获得过国家专利，同时该专利获得了第二十二届中国专利优秀奖。"
    },
    {
      companyName: "深圳亚太卫视文化传播有限公司",
      position: "技术支持",
      dateRanges: "2014.06-2016.08",
      explain: "担任该公司的技术员一职，主要负责公司网络管理、服务器维护、前端开发等相关工作。"
    }
  ],
  //项目经验配置项
  project: [
    {
      projectNum: "项目一",
      projectName: "项目建设数智化管控平台",
      projectType: "建筑行业",
      projectDesc: "该系统是一个为江西交投开发的建设管理控制平台,主要业务包含：合同管理、计量管理、变更管理、进度管理、招标采购管理等。",
      skillDesc: "前端技术架构包含 [react] + [antd] + [ echarts] + [antv]",
      responsibilityDesc: "1.	作为平台的主要开发人员，参与平台的版本迭代开发工作2.	参与系统的版本发布，确保系统的成功升级并及时响应运维人员修复系统漏洞",
    },
    {
      projectNum: "项目二",
      projectName: "云天深目系统",
      projectType: "React项目",
      projectDesc: "云天深目是一个大型的人像AI智能应用平台，主要合作方为深圳市龙岗公安分局，产品主要提供人像检索、人像布控、数据分析、高级管理等功能，其中人像检索和人像布控是产品的核心功能。。",
      skillDesc: "此项目前端基于React框架进行开发，从结构上可分为表现层、业务层、数据层。表现层选用ant Design作为前端UI库，可实现快速创建UI组件，提高页面搭建效率。业务层上则使用redux来对项目进行状态控制，有效解决了项目中多组件状态共享、视图层多数据来源、多用户类型等问题。数据层则采用axios.js进行http请求实现前后端数据通信，对axios.js进行二次封装，统一处理http错误。另外项目使用webpack作为前端自动化构建工具，实现了开发热加载，自动化打包等功能",
      responsibilityDesc: "1.负责前端需求评审工作，根据UI完成产品的前端设计和开发； 2.协助运维人员定位解决系统已发布版本的现场问题；3.参与新产品技术方案选型，编写相关开发文档、技术资料；4.负责新加入同事的前端业务引导工作，保证新同事能高效快速融入团队、熟悉公司业务；5.推动产品前端组件化，业务模块化；6.	调研前端新技术，学习分享新技术提升团队能力",
    },
    {
      projectNum: "项目三",
      projectName: "行人闯红灯系统",
      projectType: "JQuery项目",
      projectDesc: "这是一个行人闯红灯监测系统，系统主要包含信息录入，违规检索，实时告警等功能。",
      skillDesc: "此项目采用jQuery+layUI+CSS3+mqtt.js进行项目开发,因jQuery框架其强大的选择器和出色的DOM操作封装使得前端处理dom操作极其简单，外加可靠的事件处理机制和完善的Ajax请求，也使得前端的事件处理和后台数据通信操作变得轻松。页面结构搭建方面则选用了layUI来处理前端大量的表单提交需求。另外配合CSS3的animation实现了展示页面的动画效果。消息通知方面这采用了基于mqtt即时通讯协议和观察者模式设计的mqtt.js来实现，很好的替代了由前端轮询调用接口的这种高性能消耗消息查询机制。",
      responsibilityDesc: "1.作为系统的主要开发人员，参与系统的版本迭代开发工作2.参与系统的版本发布，确保系统的成功升级并及时响应运维人员修复系统漏洞",
    }
  ]
}